<!-- terraform-plan-aws:stage -->
## 🟨 Terraform plan (aws/stage) — Changes detected
**Changes:** +68 ~0 -1

```
module.platform["stage"].data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.github.aws_iam_role_policy_attachment.github_actions_terraform_apply_admin["stage"]: Refreshing state... [id=forge-github-actions-terraform-apply-stage/arn:aws:iam::aws:policy/AdministratorAccess]
module.platform["stage"].data.aws_availability_zones.available: Reading...
module.github.data.aws_caller_identity.current: Reading...
module.platform["stage"].module.assets.data.aws_caller_identity.current: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Read complete after 0s [id=869149999]
module.platform["stage"].data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.github.data.aws_kms_alias.terraform_state: Reading...
module.github.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::031374266475:oidc-provider/token.actions.githubusercontent.com]
data.aws_dynamodb_table.terraform_state_lock: Reading...
module.github.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.github.data.aws_iam_policy_document.github_actions_cms_deploy["stage"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_cms_deploy["stage"]: Read complete after 0s [id=1498207584]
module.platform["stage"].module.assets.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
data.aws_s3_bucket.terraform_state: Reading...
module.github.data.aws_kms_alias.terraform_state: Read complete after 0s [id=arn:aws:kms:us-east-2:031374266475:alias/forge-terraform-state]
module.github.data.aws_kms_key.terraform_state: Reading...
module.platform["stage"].data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role["stage"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role["stage"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_state_assume: Reading...
module.github.data.aws_iam_policy_document.github_actions_assume_role["stage"]: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role["stage"]: Read complete after 0s [id=4015899160]
module.github.data.aws_iam_policy_document.github_actions_terraform_state_assume: Read complete after 0s [id=1158300415]
module.github.data.aws_iam_policy_document.github_actions_assume_role["stage"]: Read complete after 0s [id=1668997744]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role["stage"]: Read complete after 0s [id=322147247]
module.github.data.aws_kms_key.terraform_state: Read complete after 0s [id=68220f21-2ca1-4846-9c2a-c8b6e268e63c]
module.github.aws_iam_role.github_actions_terraform_apply["stage"]: Refreshing state... [id=forge-github-actions-terraform-apply-stage]
module.github.aws_iam_role.github_actions_terraform_plan["stage"]: Refreshing state... [id=forge-github-actions-terraform-plan-stage]
module.github.aws_iam_role.github_actions_cms_deploy["stage"]: Refreshing state... [id=forge-github-actions-cms-deploy-stage]
data.aws_s3_bucket.terraform_state: Read complete after 0s [id=forge-terraform-state-031374266475]
data.aws_dynamodb_table.terraform_state_lock: Read complete after 1s [id=forge-terraform-locks]
module.github.data.aws_iam_policy_document.github_actions_terraform_state: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_state: Read complete after 0s [id=2817966150]
module.github.aws_iam_role_policy_attachment.github_actions_terraform_plan_readonly["stage"]: Refreshing state... [id=forge-github-actions-terraform-plan-stage/arn:aws:iam::aws:policy/ReadOnlyAccess]
module.github.aws_iam_role_policy.github_actions_cms_deploy["stage"]: Refreshing state... [id=forge-github-actions-cms-deploy-stage:cms-deploy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_zone.forge will be created
  + resource "aws_route53_zone" "forge" {
      + arn                         = (known after apply)
      + comment                     = "Managed by Terraform"
      + enable_accelerated_recovery = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + name                        = "forge.jesusfilm.org"
      + name_servers                = (known after apply)
      + primary_name_server         = (known after apply)
      + tags_all                    = (known after apply)
      + zone_id                     = (known after apply)
    }

  # module.github.aws_iam_policy.github_actions_terraform_apply will be created
  + resource "aws_iam_policy" "github_actions_terraform_apply" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "forge-github-actions-terraform-apply"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "wafv2:*",
                          + "secretsmanager:*",
                          + "s3:*",
                          + "route53:*",
                          + "rds:*",
                          + "logs:*",
                          + "kms:*",
                          + "elasticloadbalancing:*",
                          + "ecs:*",
                          + "ecr:*",
                          + "ec2:*",
                          + "dynamodb:*",
                          + "cloudwatch:*",
                          + "cloudfront:*",
                          + "acm:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "TerraformAwsServiceManagement"
                    },
                  + {
                      + Action   = [
                          + "iam:UpdateOpenIDConnectProviderThumbprint",
                          + "iam:UpdateAssumeRolePolicy",
                          + "iam:UntagRole",
                          + "iam:UntagPolicy",
                          + "iam:UntagOpenIDConnectProvider",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "iam:TagOpenIDConnectProvider",
                          + "iam:SetDefaultPolicyVersion",
                          + "iam:RemoveClientIDFromOpenIDConnectProvider",
                          + "iam:PutRolePolicy",
                          + "iam:PassRole",
                          + "iam:ListRoles",
                          + "iam:ListRoleTags",
                          + "iam:ListRolePolicies",
                          + "iam:ListPolicyVersions",
                          + "iam:ListPolicies",
                          + "iam:ListOpenIDConnectProviders",
                          + "iam:ListOpenIDConnectProviderTags",
                          + "iam:ListInstanceProfilesForRole",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "iam:GetPolicyVersion",
                          + "iam:GetPolicy",
                          + "iam:GetOpenIDConnectProvider",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:DeletePolicyVersion",
                          + "iam:DeletePolicy",
                          + "iam:DeleteOpenIDConnectProvider",
                          + "iam:CreateRole",
                          + "iam:CreatePolicyVersion",
                          + "iam:CreatePolicy",
                          + "iam:CreateOpenIDConnectProvider",
                          + "iam:AttachRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::*:role/forge-*",
                          + "arn:aws:iam::*:policy/forge-*",
                          + "arn:aws:iam::*:oidc-provider/token.actions.githubusercontent.com",
                        ]
                      + Sid      = "TerraformIamForForgeResources"
                    },
                  + {
                      + Action   = "iam:CreateServiceLinkedRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/aws-service-role/*"
                      + Sid      = "AllowCreateServiceLinkedRoles"
                    },
                  + {
                      + Action   = [
                          + "iam:UpdateLoginProfile",
                          + "iam:RemoveUserFromGroup",
                          + "iam:PutUserPolicy",
                          + "iam:PutGroupPolicy",
                          + "iam:DetachUserPolicy",
                          + "iam:DetachGroupPolicy",
                          + "iam:DeleteUserPolicy",
                          + "iam:DeleteUser",
                          + "iam:DeleteLoginProfile",
                          + "iam:DeleteGroupPolicy",
                          + "iam:DeleteGroup",
                          + "iam:DeleteAccessKey",
                          + "iam:CreateUser",
                          + "iam:CreateLoginProfile",
                          + "iam:CreateGroup",
                          + "iam:CreateAccessKey",
                          + "iam:AttachUserPolicy",
                          + "iam:AttachGroupPolicy",
                          + "iam:AddUserToGroup",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenyIamUserAndGroupMutation"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.github.aws_iam_role.github_actions_terraform_state will be created
  + resource "aws_iam_role" "github_actions_terraform_state" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = [
                                  + "repo:JesusFilm/forge:ref:refs/heads/main",
                                  + "repo:JesusFilm/forge:environment:github-prod",
                                  + "repo:JesusFilm/forge:environment:vercel-prod",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::031374266475:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = "AllowGitHubActionsTerraformStateAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forge-github-actions-terraform-state"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "terraform"
          + "Service"   = "github-actions"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Service"   = "github-actions"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.github.aws_iam_role_policy.github_actions_terraform_state will be created
  + resource "aws_iam_role_policy" "github_actions_terraform_state" {
      + id          = (known after apply)
      + name        = "terraform-state-only"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::forge-terraform-state-031374266475/*",
                          + "arn:aws:s3:::forge-terraform-state-031374266475",
                        ]
                      + Sid      = "StateBucketAccess"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:ConditionCheckItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-2:031374266475:table/forge-terraform-locks"
                      + Sid      = "StateLockTableAccess"
                    },
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:us-east-2:031374266475:key/68220f21-2ca1-4846-9c2a-c8b6e268e63c"
                      + Sid      = "StateKmsAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.github.aws_iam_role_policy_attachment.github_actions_terraform_apply["stage"] will be created
  + resource "aws_iam_role_policy_attachment" "github_actions_terraform_apply" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "forge-github-actions-terraform-apply-stage"
    }

  # module.github.aws_iam_role_policy_attachment.github_actions_terraform_apply_admin["stage"] will be destroyed
  # (because aws_iam_role_policy_attachment.github_actions_terraform_apply_admin is not in configuration)
  - resource "aws_iam_role_policy_attachment" "github_actions_terraform_apply_admin" {
      - id         = "forge-github-actions-terraform-apply-stage/arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "forge-github-actions-terraform-apply-stage" -> null
    }

  # module.platform["stage"].data.aws_iam_policy_document.alb_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "alb_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryWrite"

          + principals {
              + identifiers = [
                  + "logdelivery.elasticloadbalancing.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "logdelivery.elasticloadbalancing.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.platform["stage"].aws_cloudwatch_log_group.waf will be created
  + resource "aws_cloudwatch_log_group" "waf" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "aws-waf-logs-forge-platform-stage"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-2"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "platform"
        }
      + tags_all                    = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "platform"
        }
    }

  # module.platform["stage"].aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-2"
      + tags                 = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-nat-eip"
          + "Service"     = "platform"
        }
      + tags_all             = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-nat-eip"
          + "Service"     = "platform"
        }
    }

  # module.platform["stage"].aws_internet_gateway.platform will be created
  + resource "aws_internet_gateway" "platform" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-2"
      + tags     = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-igw"
          + "Service"     = "platform"
        }
      + tags_all = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-igw"
          + "Service"     = "platform"
        }
      + vpc_id   = (known after apply)
    }

  # module.platform["stage"].aws_lb.platform will be created
  + resource "aws_lb" "platform" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "forge-platform-stage-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-2"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "platform"
        }
      + tags_all                                                     = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "platform"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "forge-platform-stage-alb-logs"
          + enabled = true
          + prefix  = "alb/stage"
        }

      + subnet_mapping (known after apply)
    }

  # module.platform["stage"].aws_lb_listener.http_redirect will be created
  + resource "aws_lb_listener" "http_redirect" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-2"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.platform["stage"].aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + region                                                                = "us-east-2"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found"
              + status_code  = "404"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.platform["stage"].aws_nat_gateway.platform will be created
  + resource "aws_nat_gateway" "platform" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-2"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-nat"
          + "Service"     = "platform"
        }
      + tags_all                           = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-nat"
          + "Service"     = "platform"
        }
      + vpc_id                             = (known after apply)
    }

  # module.platform["stage"].aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-private-rt"
          + "Service"     = "platform"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-private-rt"
          + "Service"     = "platform"
        }
      + vpc_id           = (known after apply)
    }

  # module.platform["stage"].aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-public-rt"
          + "Service"     = "platform"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-public-rt"
          + "Service"     = "platform"
        }
      + vpc_id           = (known after apply)
    }

  # module.platform["stage"].aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.platform["stage"].aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.platform["stage"].aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.platform["stage"].aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.platform["stage"].aws_s3_bucket.alb_logs will be created
  + resource "aws_s3_bucket" "alb_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "forge-platform-stage-alb-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "platform"
        }
      + tags_all                    = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "platform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.platform["stage"].aws_s3_bucket_policy.alb_logs will be created
  + resource "aws_s3_bucket_policy" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # module.platform["stage"].aws_s3_bucket_public_access_block.alb_logs will be created
  + resource "aws_s3_bucket_public_access_block" "alb_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
    }

  # module.platform["stage"].aws_s3_bucket_server_side_encryption_configuration.alb_logs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "alb_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.platform["stage"].aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "ALB ingress security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "forge-platform-stage-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-alb-sg"
          + "Service"     = "platform"
        }
      + tags_all               = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-alb-sg"
          + "Service"     = "platform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.platform["stage"].aws_security_group.ecs_service will be created
  + resource "aws_security_group" "ecs_service" {
      + arn                    = (known after apply)
      + description            = "Application ECS service security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "forge-platform-stage-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-ecs-sg"
          + "Service"     = "platform"
        }
      + tags_all               = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-ecs-sg"
          + "Service"     = "platform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.platform["stage"].aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Application postgres security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "ECS to Postgres"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "forge-platform-stage-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-rds-sg"
          + "Service"     = "platform"
        }
      + tags_all               = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-rds-sg"
          + "Service"     = "platform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.platform["stage"].aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.31.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-platform-stage-private-1"
          + "Service"     = "platform"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-p

... (truncated)
```
